#include <iostream>
#include <vector>
using namespace std;

string numbers_1_19[] = {"", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять", "десять",
                         "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять",
                         "сімнадцять", "вісімнадцять", "дев'ятнадцять"};

string tens[] = {"", "", "двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев'яносто"};

string hundreds[] = {"", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот"};

string numWords(int n) {
    if (n == 1000) return "тисяча";
    
    string result = "";
    if (n >= 100) {
        result += hundreds[n / 100] + " ";
        n %= 100;
    }
    if (n >= 20) {
        result += tens[n / 10] + " ";
        n %= 10;
    }
    if (n > 0) {
        result += numbers_1_19[n] + " ";
    }
    
    return result;
}

int main() {
    int n;
    cout << "Введіть число (1-1000): ";
    cin >> n;
    
    if (n < 1 || n > 1000) {
        cout << "Число повинно бути від 1 до 1000" << endl;
    } else {
        cout << numWords(n) << endl;
    }
    
    return 0;
}
