#include <iostream>
#include <string>
using namespace std;

string ones[] = { "", "один", "два", "три", "чотири", "п’ять", "шість", "сім", "вісім", "дев’ять" };
string teens[] = { "десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п’ятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "дев’ятнадцять" };
string tens[] = { "", "десять", "двадцять", "тридцять", "сорок", "п’ятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев’яносто" };
string hundreds[] = { "", "сто", "двісті", "триста", "чотириста", "п’ятсот", "шістсот", "сімсот", "вісімсот", "дев’ятсот" };

string numberToWords(int n) {
    if (n == 1000) return "тисяча";

    string result = "";

    if (n >= 100) {
        result += hundreds[n / 100] + " "; 
        n %= 100; 
    }

    if (n >= 20) {
        result += tens[n / 10] + " "; 
        n %= 10; 
    }

    if (n >= 10) {
        result += teens[n - 10] + " "; 
        n = 0; 
    }

    if (n > 0) {
        result += ones[n] + " "; 
    }

    return result;
}

int main() {
    int n;
    cout << "Введіть число (0 <= n <= 1000): ";
    cin >> n;

    if (n < 0 || n > 1000) {
        cout << "Число має бути в межах від 0 до 1000.";
    }
    else {
        cout << "Число словами: " << numberToWords(n) << endl;
    }

    return 0;
}
